
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>CSS · Sputnik</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Methodology/Readme.html" />
    
    
    <link rel="prev" href="../HTML/Readme.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">Оглавление</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../HTML/Readme.html">
            
                <a href="../HTML/Readme.html">
            
                    
                    HTML
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="Readme.html">
            
                <a href="Readme.html">
            
                    
                    CSS
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="Methodology/Readme.html">
            
                <a href="Methodology/Readme.html">
            
                    
                    Методологии
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="Methodology/BEM.html">
            
                <a href="Methodology/BEM.html">
            
                    
                    BEM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="Methodology/CSSModules.html">
            
                <a href="Methodology/CSSModules.html">
            
                    
                    CSS Modules
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../JavaScript/Readme.html">
            
                <a href="../JavaScript/Readme.html">
            
                    
                    JavaScript
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../JavaScript/Perfomance.html">
            
                <a href="../JavaScript/Perfomance.html">
            
                    
                    Perfomance
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../JavaScript/Testing.html">
            
                <a href="../JavaScript/Testing.html">
            
                    
                    Testing
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../JavaScript/Debug.html">
            
                <a href="../JavaScript/Debug.html">
            
                    
                    Debug
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../JavaScript/ESNext/Readme.html">
            
                <a href="../JavaScript/ESNext/Readme.html">
            
                    
                    ESNext
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.4.1" data-path="../JavaScript/ESNext/ES2015.html">
            
                <a href="../JavaScript/ESNext/ES2015.html">
            
                    
                    ES2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4.2" data-path="../JavaScript/ESNext/ES2016.html">
            
                <a href="../JavaScript/ESNext/ES2016.html">
            
                    
                    ES2016
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Git/Readme.html">
            
                <a href="../Git/Readme.html">
            
                    
                    Git
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../Git/Convention.html">
            
                <a href="../Git/Convention.html">
            
                    
                    Convention
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../Git/Workflow.html">
            
                <a href="../Git/Workflow.html">
            
                    
                    Workflow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../Git/Advices.html">
            
                <a href="../Git/Advices.html">
            
                    
                    Advices
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../Git/PullRequests.html">
            
                <a href="../Git/PullRequests.html">
            
                    
                    Pull Requests
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../Common/UsefulLinks.html">
            
                <a href="../Common/UsefulLinks.html">
            
                    
                    Полезные ссылки
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../Common/CodeEditors.html">
            
                <a href="../Common/CodeEditors.html">
            
                    
                    Плагины для вашего редактора
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >CSS</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="css">CSS</h1>
<h2 id="&#x43E;&#x431;&#x449;&#x435;&#x435;">&#x41E;&#x431;&#x449;&#x435;&#x435;</h2>
<ul>
<li><p>&#x421;&#x442;&#x430;&#x440;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44C; &#x43D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x438;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x438; CSS, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;
<code>margin: 10px 20px 30px 40px</code>. &#x41D;&#x435;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x44F; &#x43D;&#x430; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x443;&#x441;&#x43A;&#x43E;&#x440;&#x44F;&#x435;&#x442;
(&#x43D;&#x435;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;) &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435; CSS, &#x432; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x43C; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442; &#x43A; &#x432;&#x43E;&#x437;&#x43D;&#x438;&#x43A;&#x43D;&#x43E;&#x432;&#x435;&#x43D;&#x438;&#x44E;
&#x43A;&#x43E;&#x43D;&#x444;&#x43B;&#x438;&#x43A;&#x442;&#x43E;&#x432; &#x432; Git (&#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x432;&#x435;&#x442;&#x43A;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x43B;&#x438; top-&#x447;&#x430;&#x441;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;, &#x432; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C;
bottom &#x2014; &#x43F;&#x43E;&#x43C;&#x435;&#x43D;&#x44F;&#x43B;&#x430;&#x441;&#x44C; &#x43E;&#x434;&#x43D;&#x430; &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43A;&#x430; &#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43A;&#x43E;&#x43D;&#x444;&#x43B;&#x438;&#x43A;&#x442;), &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x435;&#x435; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x442;&#x43E;&#x433;&#x43E;,
&#x43A;&#x442;&#x43E; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x438;&#x439; &#x440;&#x430;&#x437; &#x43C;&#x435;&#x43D;&#x44F;&#x43B; &#x43D;&#x443;&#x436;&#x43D;&#x443;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x44C; (blame &#x431;&#x443;&#x434;&#x435;&#x442; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x442;&#x43E;&#x433;&#x43E;, &#x43A;&#x442;&#x43E;
&#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x438;&#x439; &#x440;&#x430;&#x437; &#x43C;&#x435;&#x43D;&#x44F;&#x43B; &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43A;&#x443;, &#x430; &#x43D;&#x435; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;), &#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x439;&#x43D;&#x43E;
&#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x442;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x435; &#x43F;&#x43B;&#x430;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C;
(<code>background: red</code> &#x441;&#x431;&#x440;&#x43E;&#x441;&#x438;&#x442; &#x432;&#x441;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;,
background-image &#x43A; &#x434;&#x435;&#x444;&#x43E;&#x43B;&#x442;&#x43D;&#x44B;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F;&#x43C;).</p>
<pre class="language-"><code class="lang-css"><span class="token comment" spellcheck="true">/* &#x41D;&#x435;&#x434;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E; */</span>
<span class="token selector">.header</span> <span class="token punctuation">{</span>
  <span class="token property">margin</span><span class="token punctuation">:</span> 10px 20px 30px 40px<span class="token punctuation">;</span>
<span class="token punctuation">}</span>

<span class="token comment" spellcheck="true">/* &#x41F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; */</span>
<span class="token selector">.header</span> <span class="token punctuation">{</span>
  <span class="token property">margin-top</span><span class="token punctuation">:</span> 10px<span class="token punctuation">;</span>
  <span class="token property">margin-right</span><span class="token punctuation">:</span> 20px<span class="token punctuation">;</span>
  <span class="token property">margin-bottom</span><span class="token punctuation">:</span> 30px<span class="token punctuation">;</span>
  <span class="token property">margin-left</span><span class="token punctuation">:</span> 40px<span class="token punctuation">;</span>
<span class="token punctuation">}</span>
</code></pre>
</li>
<li>&#x41F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x439;&#x442;&#x435; &#x441;&#x442;&#x438;&#x43B;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430; &#x43D;&#x430; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x435; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x440;&#x438; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;.
&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43F;&#x440;&#x438; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x43E;&#x43C; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430; &#x438;&#x43B;&#x438; &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430; &#x43D;&#x435;&#x442; &#x441;&#x43E;&#x432;&#x441;&#x435;&#x43C;.</li>
</ul>
<h2 id="&#x438;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x435;-&#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B;">&#x418;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x435; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x44B;</h2>
<ul>
<li>&#x41F;&#x440;&#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x438; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; (&#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x441; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C;&#x438; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x43C;&#x43E;&#x436;&#x435;&#x442;
&#x43A;&#x430;&#x43A;-&#x442;&#x43E; &#x432;&#x437;&#x430;&#x438;&#x43C;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x2014; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43F;&#x43E; &#x43D;&#x430;&#x436;&#x430;&#x442;&#x438;&#x44E; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x438;&#x43B;&#x438;
&#x43D;&#x430;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44E; &#x43D;&#x430; &#x43D;&#x435;&#x433;&#x43E;), &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x443;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F;:<ul>
<li>hover &#x2014; c&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x438; &#x43C;&#x44B;&#x448;&#x44C;&#x44E; &#x43D;&#x430; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;;</li>
<li>focus &#x2014; c&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435; &#x43F;&#x440;&#x438; &#xAB;&#x43D;&#x430;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x438;&#xBB; &#x43D;&#x430; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x441; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x430;&#x442;&#x443;&#x440;&#x44B; (&#x442;&#x430;&#x431;&#x43E;&#x43C;). &#x424;&#x43E;&#x43A;&#x443;&#x441;
&#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x431;&#x44B;&#x442;&#x44C; &#x44F;&#x432;&#x43D;&#x43E; &#x432;&#x438;&#x434;&#x435;&#x43D; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435;, &#x442;.&#x435;. &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E; &#x432;&#x438;&#x434;&#x43D;&#x43E; &#x438;
&#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x43D;&#x43E;, &#x43A;&#x430;&#x43A;&#x43E;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x43F;&#x43E;&#x434; &#x444;&#x43E;&#x43A;&#x443;&#x441;&#x43E;&#x43C;. &#x41D;&#x430;&#x438;&#x43B;&#x443;&#x447;&#x448;&#x438;&#x43C; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x43C; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F;
&#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x439; <code>outline</code>. &#x41D;&#x435; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x43D;&#x430; &#x441;&#x43C;&#x435;&#x43D;&#x443; &#x446;&#x432;&#x435;&#x442;&#x430; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x430; \
&#x444;&#x43E;&#x43D;&#x430;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x43C;&#x430;&#x43B;&#x43E;&#x437;&#x430;&#x43C;&#x435;&#x442;&#x43D;&#x43E;. &#x414;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x43C;&#x435;&#x43D;&#x430; &#x446;&#x432;&#x435;&#x442;&#x430; <code>outline</code>
&#x43D;&#x430; &#x442;&#x43E;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x432;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x434;&#x438;&#x437;&#x430;&#x439;&#x43D; &#x441;&#x430;&#x439;&#x442;&#x430;;</li>
<li>disabled &#x2014; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435;, &#x435;&#x441;&#x43B;&#x438; &#x441;&#x435;&#x43C;&#x430;&#x43D;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435; &#x435;&#x441;&#x442;&#x44C;.</li>
</ul>
</li>
<li>&#x412; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x44F; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x44B;&#x445; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x439; &#x432; &#x43C;&#x430;&#x43A;&#x435;&#x442;&#x430;&#x445;, &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x438;&#x442;&#x435; &#x438;&#x445; &#x443; &#x43C;&#x435;&#x43D;&#x435;&#x434;&#x436;&#x435;&#x440;&#x430;
&#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430; \ &#x434;&#x438;&#x437;&#x430;&#x439;&#x43D;&#x435;&#x440;&#x430;. &#x415;&#x441;&#x43B;&#x438; &#x43A;&#x43E;&#x43D;&#x442;&#x430;&#x43A;&#x442;&#x430; &#x441; &#x434;&#x438;&#x437;&#x430;&#x439;&#x43D;&#x435;&#x440;&#x43E;&#x43C; &#x43D;&#x435;&#x442; &#x438;&#x43B;&#x438; &#x43F;&#x43E; &#x43A;&#x430;&#x43A;&#x438;&#x43C;-&#x43B;&#x438;&#x431;&#x43E;
&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x430;&#x43C; &#x43D;&#x435;&#x442; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F;, &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x44C;&#x442;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x435; &#x441;&#x442;&#x438;&#x43B;&#x438;,
&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x43C;&#x44B;&#x435; &#x432; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x44F;&#x445;: &#x434;&#x43B;&#x44F; &#x445;&#x43E;&#x432;&#x435;&#x440;&#x430; &#x437;&#x430;&#x442;&#x435;&#x43C;&#x43D;&#x435;&#x43D;&#x438;&#x435; \ &#x432;&#x44B;&#x441;&#x432;&#x435;&#x442;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x446;&#x432;&#x435;&#x442;&#x430;
&#x442;&#x435;&#x43A;&#x441;&#x442;&#x430; \ &#x444;&#x43E;&#x43D;&#x430;, &#x434;&#x43B;&#x44F; &#x444;&#x43E;&#x43A;&#x443;&#x441;&#x430; &#x2014; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x439; &#x430;&#x443;&#x442;&#x43B;&#x430;&#x439;&#x43D;, &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x2014; &#x432;&#x44B;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x44C;
&#x445;&#x43E;&#x432;&#x435;&#x440; &#x438; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x444;&#x43E;&#x43D; \ &#x442;&#x435;&#x43A;&#x441;&#x442; &#x441;&#x435;&#x440;&#x44B;&#x43C;.</li>
<li>&#x423;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x439;&#x442;&#x435; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x43A;&#x43B;&#x438;&#x43A;&#x430; &#x43D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x421;&#x442;&#x43E;&#x438;&#x442; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x438;&#x43C;
&#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; <code>padding</code>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x441;&#x442;&#x430;&#x43B;&#x430; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;
&#x438; &#x432; &#x43D;&#x435;&#x433;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x43F;&#x440;&#x43E;&#x449;&#x435; &#x43F;&#x43E;&#x43F;&#x430;&#x441;&#x442;&#x44C;.</li>
</ul>
<h2 id="&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x438;">&#x410;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x438;</h2>
<ul>
<li>&#x41D;&#x435; &#x430;&#x43D;&#x438;&#x43C;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x442; reflow (layout) &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;.
&#x422;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x442;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x432;&#x43B;&#x438;&#x44F;&#x44E;&#x442; &#x43D;&#x430; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x44B; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x438;&#x43B;&#x438; &#x43D;&#x430; &#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;
&#x441;&#x43E;&#x441;&#x435;&#x434;&#x43D;&#x438;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x41A; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43E;&#x442;&#x43D;&#x435;&#x441;&#x442;&#x438; <code>width</code> &#x438; <code>margin</code>.
&#x410;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x44F; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43C;&#x435;&#x434;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x43C;&#x435;&#x434;&#x43B;&#x435;&#x43D;&#x43D;&#x43E; &#x43D;&#x430; &#x441;&#x43B;&#x430;&#x431;&#x44B;&#x445;
&#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;&#x445;, &#x43B;&#x443;&#x447;&#x448;&#x435; &#x43E;&#x431;&#x43E;&#x439;&#x442;&#x438;&#x441;&#x44C; &#x431;&#x435;&#x437; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x438; &#x438;&#x43B;&#x438; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x438;,
&#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x43E;&#x431;&#x43E;&#x439;&#x442;&#x438;&#x441;&#x44C; &#x431;&#x435;&#x437; reflow.</li>
<li>&#x41D;&#x435; &#x430;&#x43D;&#x438;&#x43C;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x442; repaint &#x443; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x431;&#x43B;&#x43E;&#x43A;&#x43E;&#x432;.
&#x422;&#x430;&#x43A;&#x430;&#x44F; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x44F; &#x445;&#x43E;&#x442;&#x44C; &#x438; &#x433;&#x43E;&#x440;&#x430;&#x437;&#x434;&#x43E; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x435;&#x435;, &#x447;&#x435;&#x43C; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x44F; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432; &#x441; reflow,
&#x43D;&#x43E; &#x432;&#x441;&#x451; &#x440;&#x430;&#x432;&#x43D;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x43C;&#x435;&#x434;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x439;.</li>
<li><p>&#x41B;&#x443;&#x447;&#x448;&#x438;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x434;&#x43B;&#x44F; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x438; &#x2014; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x442; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; compositing.
&#x422;&#x430;&#x43A;&#x430;&#x44F; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x44F; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439;. &#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x430;&#x44F; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430;,
&#x447;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x2014; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; <code>opacity</code> &#x438; <code>transform</code>.
&#x41D;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43D;&#x438;&#x445; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x44D;&#x43C;&#x443;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x44E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x430; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;.
&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p>
<pre class="language-"><code class="lang-css"><span class="token comment" spellcheck="true">/* &#x414;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E; &#x434;&#x43B;&#x44F; &#x43D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x431;&#x43B;&#x43E;&#x43A;&#x43E;&#x432; */</span>
<span class="token selector">div</span> <span class="token punctuation">{</span>
  <span class="token property">background-color</span><span class="token punctuation">:</span> red<span class="token punctuation">;</span>
  <span class="token property">transition</span><span class="token punctuation">:</span> background-color .3s ease<span class="token punctuation">;</span>
<span class="token punctuation">}</span>

<span class="token selector">div:hover</span> <span class="token punctuation">{</span>
  <span class="token property">background-color</span><span class="token punctuation">:</span> blue<span class="token punctuation">;</span>
<span class="token punctuation">}</span>

<span class="token comment" spellcheck="true">/* &#x411;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x438;, &#x43D;&#x43E; &#x43F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x437;&#x430;&#x43C;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x439; */</span>
<span class="token comment" spellcheck="true">/* &#x420;&#x430;&#x437;&#x43D;&#x44B;&#x439; &#x444;&#x43E;&#x43D; &#x432; 2 &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x445;, &#x43F;&#x440;&#x438; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x43C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x44B;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; */</span>
<span class="token selector">div::after,
div::before</span> <span class="token punctuation">{</span>
  <span class="token property">content</span><span class="token punctuation">:</span> <span class="token string">&apos;&apos;</span><span class="token punctuation">;</span>
  <span class="token property">width</span><span class="token punctuation">:</span> 100%<span class="token punctuation">;</span>
  <span class="token property">height</span><span class="token punctuation">:</span> 100%<span class="token punctuation">;</span>
  <span class="token property">opacity</span><span class="token punctuation">:</span> 0<span class="token punctuation">;</span>
  <span class="token property">transition</span><span class="token punctuation">:</span> opacity .3s ease<span class="token punctuation">;</span>
<span class="token punctuation">}</span>

<span class="token selector">div::after</span> <span class="token punctuation">{</span>
  <span class="token property">background-color</span><span class="token punctuation">:</span> red<span class="token punctuation">;</span>
  <span class="token property">opacity</span><span class="token punctuation">:</span> 1<span class="token punctuation">;</span>
<span class="token punctuation">}</span>

<span class="token selector">div:hover::after</span> <span class="token punctuation">{</span>
  <span class="token property">background-color</span><span class="token punctuation">:</span> blue<span class="token punctuation">;</span>
  <span class="token property">opacity</span><span class="token punctuation">:</span> 1
<span class="token punctuation">}</span>
</code></pre>
</li>
</ul>
<p>&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x435;&#x435;:</p>
<ul>
<li><a href="https://habrahabr.ru/company/yandex/blog/239169/" target="_blank">&#x410;&#x43F;&#x43F;&#x430;&#x440;&#x430;&#x442;&#x43D;&#x43E;&#x435; &#x443;&#x441;&#x43A;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x435; &#x432; &#x436;&#x438;&#x437;&#x43D;&#x438; &#x432;&#x435;&#x440;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x449;&#x438;&#x43A;&#x430;</a></li>
<li><a href="https://habrahabr.ru/company/odnoklassniki/blog/313978/" target="_blank">&#x410;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x438; &#x43D;&#x430; GPU</a></li>
<li><a href="https://csstriggers.com/" target="_blank">CSS Triggers</a></li>
</ul>
<h2 id="&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x441;&#x442;&#x44C;">&#x414;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x441;&#x442;&#x44C;</h2>
<ul>
<li><p>&#x420;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x430;&#x44E;&#x442; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432;&#x438;&#x434;&#x43E;&#x432; &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x44F; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;:</p>
<ul>
<li>&#x41F;&#x43E;&#x43B;&#x43D;&#x43E;&#x435; &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x435; &#x2014; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x432;&#x438;&#x434;&#x435;&#x43D; &#x43D;&#x430; &#x44D;&#x43A;&#x440;&#x430;&#x43D;&#x435;, &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x435;&#x43D; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x438; &#x441;
&#x43A;&#x43B;&#x430;&#x432;&#x438;&#x430;&#x442;&#x443;&#x440;&#x44B; &#x438; &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x435;&#x43D; &#x441;&#x43A;&#x440;&#x438;&#x43D;&#x440;&#x438;&#x434;&#x435;&#x440;&#x430;&#x43C;. &#x41F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x44C;
&#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x435;&#x445;. &#x42D;&#x442;&#x43E; &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; <code>display: none</code>, <code>visibility: hidden;</code>
&#x438;&#x43B;&#x438; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>hidden</code>.</li>
<li>&#x412;&#x438;&#x437;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x2014; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x432;&#x438;&#x434;&#x435;&#x43D; &#x43D;&#x430; &#x44D;&#x43A;&#x440;&#x430;&#x43D;&#x435;, &#x43D;&#x43E; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x435;&#x43D; &#x434;&#x43B;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x441;
&#x43A;&#x43B;&#x430;&#x432;&#x438;&#x430;&#x442;&#x443;&#x440;&#x44B; &#x438; &#x434;&#x43B;&#x44F; &#x44D;&#x43A;&#x440;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x447;&#x438;&#x442;&#x430;&#x43B;&#x43E;&#x43A;. &#x41F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;
&#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435;&#x432;&#x438;&#x434;&#x438;&#x43C;&#x44B;&#x43C;, &#x43D;&#x43E; &#x43F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x432;&#x437;&#x430;&#x438;&#x43C;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x441; &#x44D;&#x442;&#x438;&#x43C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C;.
&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x435; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x445; &#x440;&#x430;&#x434;&#x438;&#x43E;&#x43A;&#x43D;&#x43E;&#x43F;&#x43E;&#x43A; \ &#x447;&#x435;&#x43A;&#x431;&#x43E;&#x43A;&#x441;&#x43E;&#x432; &#x2014; &#x435;&#x441;&#x43B;&#x438; &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x44C; &#x438;&#x445; &#x447;&#x435;&#x440;&#x435;&#x437;
<code>display: none</code>, &#x442;&#x43E; &#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x44B; &#x447;&#x438;&#x442;&#x430;&#x43B;&#x43A;&#x430;&#x43C; \ &#x441;&#x43A;&#x440;&#x438;&#x43D;&#x440;&#x438;&#x434;&#x435;&#x440;&#x430;&#x43C;.
&#x42D;&#x442;&#x43E; &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; &#x442;&#x435;&#x445;&#x43D;&#x438;&#x43A;&#x443; <a href="https://github.com/h5bp/html5-boilerplate/blob/v5.0.0/src/css/main.css#L126-L140" target="_blank">visuallyhidden</a>.</li>
<li>&#x421;&#x435;&#x43C;&#x430;&#x43D;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x435; &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x435; &#x2014; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x432;&#x438;&#x434;&#x435;&#x43D; &#x43D;&#x430; &#x44D;&#x43A;&#x440;&#x430;&#x43D;&#x435;, &#x43D;&#x43E; &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x435;&#x43D; &#x434;&#x43B;&#x44F;
&#x441;&#x43A;&#x440;&#x438;&#x43D;&#x440;&#x438;&#x434;&#x435;&#x440;&#x43E;&#x432;. &#x41F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x44F; &#x43F;&#x440;&#x435;&#x437;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x445; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;.
&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x435;&#x441;&#x43B;&#x438; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x430; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x432; &#x441;&#x435;&#x431;&#x435; &#x438;&#x43A;&#x43E;&#x43D;&#x43A;&#x443;, &#x442;&#x43E; &#x441;&#x43A;&#x440;&#x438;&#x43D;&#x440;&#x438;&#x434;&#x435;&#x440; &#x43D;&#x435; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D;
&#x437;&#x430;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x443; &#x438;&#x43A;&#x43E;&#x43D;&#x43A;&#x443; (&#x43D;&#x43E; &#x43F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x432; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x435; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x431;&#x44B;&#x442;&#x44C; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>title</code>,
&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x43E;&#x435; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F;).
&#x42D;&#x442;&#x43E; &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>aria-hidden=&quot;true&quot;</code>.</li>
</ul>
<pre class="language-"><code class="lang-css"><span class="token comment" spellcheck="true">/* &#x41D;&#x435;&#x434;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E; */</span>
<span class="token selector">input[type=radio]</span> <span class="token punctuation">{</span>
  <span class="token property">display</span><span class="token punctuation">:</span> none
<span class="token punctuation">}</span>

<span class="token comment" spellcheck="true">/* &#x41F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; */</span>
<span class="token selector">input[type=radio]</span> <span class="token punctuation">{</span>
  <span class="token atrule"><span class="token rule">@extend</span> .visuallyhidden<span class="token punctuation">;</span></span>
<span class="token punctuation">}</span>
</code></pre>
</li>
<li><p>&#x421;&#x435;&#x43C;&#x430;&#x43D;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x430;&#x44F; &#x438; &#x432;&#x438;&#x437;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x440;&#x43E;&#x43B;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x442;&#x44C;&#x441;&#x44F;: &#x432;&#x438;&#x437;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C;
&#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x430;, &#x430; &#x441;&#x435;&#x43C;&#x430;&#x43D;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x2014; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x430;. &#x418; &#x43D;&#x430;&#x43E;&#x431;&#x43E;&#x440;&#x43E;&#x442;. &#x41F;&#x440;&#x438; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x441;&#x442;&#x43E;&#x438;&#x442;
&#x443;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E;&#x442; &#x43D;&#x44E;&#x430;&#x43D;&#x441; &#x438; &#x441;&#x431;&#x440;&#x430;&#x441;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x435; &#x441;&#x442;&#x438;&#x43B;&#x438; &#x442;&#x435;&#x433;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C;&#x438; &#x44D;&#x442;&#x43E;&#x442;
&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43E;&#x431;&#x43B;&#x430;&#x434;&#x430;&#x442;&#x44C;.</p>
<pre class="language-"><code class="lang-css"><span class="token comment" spellcheck="true">/* &#x41D;&#x435;&#x434;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E; */</span>
<span class="token selector">.link</span> <span class="token punctuation">{</span>
  <span class="token property">color</span><span class="token punctuation">:</span> red<span class="token punctuation">;</span>
<span class="token punctuation">}</span>

<span class="token comment" spellcheck="true">/* &#x41F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; */</span>
<span class="token selector">.link</span> <span class="token punctuation">{</span>
  <span class="token comment" spellcheck="true">/* &#x441;&#x431;&#x440;&#x43E;&#x441; &#x432;&#x441;&#x435;&#x445; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432; &#x43A; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44E; &#x43F;&#x43E;-&#x443;&#x43C;&#x43E;&#x43B;&#x447;&#x430;&#x43D;&#x438;&#x44E;, */</span>
  <span class="token comment" spellcheck="true">/* &#x443;&#x431;&#x438;&#x440;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x438;&#x435; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x432;&#x441;&#x435;&#x43C;&#x438; &#x442;&#x435;&#x433;&#x430;&#x43C;&#x438; */</span>
  <span class="token property">all</span><span class="token punctuation">:</span> initial<span class="token punctuation">;</span>
  <span class="token property">color</span><span class="token punctuation">:</span> red<span class="token punctuation">;</span>
<span class="token punctuation">}</span>
<span class="token selector">.link</span> <span class="token punctuation">{</span>
  <span class="token comment" spellcheck="true">/* &#x421;&#x431;&#x440;&#x43E;&#x441; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x445; &#x441;&#x442;&#x438;&#x43B;&#x435;&#x439; &lt;button&gt; */</span>
  <span class="token property">background</span><span class="token punctuation">:</span> none<span class="token punctuation">;</span>
  <span class="token property">border</span><span class="token punctuation">:</span> 0<span class="token punctuation">;</span>
  <span class="token property">color</span><span class="token punctuation">:</span> inherit<span class="token punctuation">;</span>
  <span class="token property">font</span><span class="token punctuation">:</span> inherit<span class="token punctuation">;</span>
  <span class="token property">line-height</span><span class="token punctuation">:</span> normal<span class="token punctuation">;</span>
  <span class="token property">overflow</span><span class="token punctuation">:</span> visible<span class="token punctuation">;</span>
  <span class="token property">padding</span><span class="token punctuation">:</span> 0<span class="token punctuation">;</span>
  <span class="token property">user-select</span><span class="token punctuation">:</span> none<span class="token punctuation">;</span>

  <span class="token property">color</span><span class="token punctuation">:</span> red<span class="token punctuation">;</span>
<span class="token punctuation">}</span>
</code></pre>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../HTML/Readme.html" class="navigation navigation-prev " aria-label="Previous page: HTML">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Methodology/Readme.html" class="navigation navigation-next " aria-label="Next page: Методологии">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"CSS","level":"1.3","depth":1,"next":{"title":"Методологии","level":"1.3.1","depth":2,"path":"CSS/Methodology/Readme.md","ref":"./CSS/Methodology/Readme.md","articles":[{"title":"BEM","level":"1.3.1.1","depth":3,"path":"CSS/Methodology/BEM.md","ref":"./CSS/Methodology/BEM.md","articles":[]},{"title":"CSS Modules","level":"1.3.1.2","depth":3,"path":"CSS/Methodology/CSSModules.md","ref":"./CSS/Methodology/CSSModules.md","articles":[]}]},"previous":{"title":"HTML","level":"1.2","depth":1,"path":"HTML/Readme.md","ref":"./HTML/Readme.md","articles":[]},"dir":"ltr"},"config":{"plugins":["edit-link","prism","-highlight","github","anchorjs"],"root":"./docs","styles":{"website":"build/gitbook.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/CSSSR/sputnik"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Edit This Page","base":"https://github.com/CSSSR/sputnik/blob/master/docs"},"theme-default":{"styles":{"website":"build/gitbook.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchorjs":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Sputnik","gitbook":">=3.2.1"},"file":{"path":"CSS/Readme.md","mtime":"2018-04-02T09:07:44.534Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-02T11:36:38.053Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/anchor-js/4.1.0/anchor.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-anchorjs/anchor-style.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

