
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Debug · Sputnik</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ESNext/Readme.html" />
    
    
    <link rel="prev" href="Testing.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">Оглавление</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../HTML/Readme.html">
            
                <a href="../HTML/Readme.html">
            
                    
                    HTML
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../CSS/Readme.html">
            
                <a href="../CSS/Readme.html">
            
                    
                    CSS
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../CSS/Methodology/Readme.html">
            
                <a href="../CSS/Methodology/Readme.html">
            
                    
                    Методологии
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="../CSS/Methodology/BEM.html">
            
                <a href="../CSS/Methodology/BEM.html">
            
                    
                    BEM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="../CSS/Methodology/CSSModules.html">
            
                <a href="../CSS/Methodology/CSSModules.html">
            
                    
                    CSS Modules
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Readme.html">
            
                <a href="Readme.html">
            
                    
                    JavaScript
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="Perfomance.html">
            
                <a href="Perfomance.html">
            
                    
                    Perfomance
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="Testing.html">
            
                <a href="Testing.html">
            
                    
                    Testing
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.3" data-path="Debug.html">
            
                <a href="Debug.html">
            
                    
                    Debug
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="ESNext/Readme.html">
            
                <a href="ESNext/Readme.html">
            
                    
                    ESNext
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.4.1" data-path="ESNext/ES2015.html">
            
                <a href="ESNext/ES2015.html">
            
                    
                    ES2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4.2" data-path="ESNext/ES2016.html">
            
                <a href="ESNext/ES2016.html">
            
                    
                    ES2016
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Git/Readme.html">
            
                <a href="../Git/Readme.html">
            
                    
                    Git
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../Git/Convention.html">
            
                <a href="../Git/Convention.html">
            
                    
                    Convention
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../Git/Workflow.html">
            
                <a href="../Git/Workflow.html">
            
                    
                    Workflow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../Git/Advices.html">
            
                <a href="../Git/Advices.html">
            
                    
                    Advices
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../Git/PullRequests.html">
            
                <a href="../Git/PullRequests.html">
            
                    
                    Pull Requests
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../Common/UsefulLinks.html">
            
                <a href="../Common/UsefulLinks.html">
            
                    
                    Полезные ссылки
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../Common/CodeEditors.html">
            
                <a href="../Common/CodeEditors.html">
            
                    
                    Плагины для вашего редактора
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Debug</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x430;">&#x41E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x430;</h1>
<p>&#x412;&#x43E; &#x432;&#x441;&#x435;&#x445; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x435;&#x441;&#x442;&#x44C; &#x43C;&#x43E;&#x449;&#x43D;&#x44B;&#x435; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;,
&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E; &#x438; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x43E; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x432; &#x43A;&#x43E;&#x434;&#x435;.
&#x413;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x435;, &#x43D;&#x430;&#x443;&#x447;&#x438;&#x442;&#x441;&#x44F; &#x438;&#x43C;&#x438; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F;. &#x414;&#x430;&#x43B;&#x435;&#x435; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; Google Chrome &#x43A;&#x430;&#x43A; &#x438;&#x43C;&#x435;&#x44E;&#x449;&#x438;&#x439; &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43C;&#x43E;&#x449;&#x43D;&#x44B;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x438;.</p>
<h2 id="&#x43F;&#x43E;&#x438;&#x441;&#x43A;-&#x43E;&#x448;&#x438;&#x431;&#x43E;&#x43A;-&#x432;-&#x43A;&#x43E;&#x434;&#x435;">&#x41F;&#x43E;&#x438;&#x441;&#x43A; &#x43E;&#x448;&#x438;&#x431;&#x43E;&#x43A; &#x432; &#x43A;&#x43E;&#x434;&#x435;</h2>
<p>&#x414;&#x43B;&#x44F; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430; &#x43E;&#x448;&#x438;&#x431;&#x43E;&#x43A; &#x431;&#x438;&#x437;&#x43D;&#x435;&#x441;-&#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x438; &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43A;&#x43E;&#x434;&#x435; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x447;&#x43A;&#x430;&#x43C;&#x438; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x430; (breakpoints), &#x43A;&#x430;&#x43A; &#x438;&#x437; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x447;&#x438;&#x43A;&#x430; Chrome Dev Tools, &#x442;&#x430;&#x43A; &#x438; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x432; &#x432; &#x43C;&#x435;&#x441;&#x442;&#x435;, &#x43D;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x43E;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>debbuger</code>. &#x412; &#x442;&#x43E;&#x447;&#x43A;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x430; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x443;&#x432;&#x438;&#x434;&#x435;&#x442;&#x44C; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x435; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435; &#x432;&#x430;&#x448;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x44B; (&#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x430; &#x432;&#x437;&#x44F;&#x442; &#x43A;&#x43E;&#x434; &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; google.com):</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-02-1545-yxegm9006a.png" alt=""></p>
<p>&#x414;&#x430;&#x436;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x432;&#x448;&#x438;&#x441;&#x44C; &#x432; &#x43A;&#x430;&#x43A;&#x43E;&#x439;-&#x442;&#x43E; &#x442;&#x43E;&#x447;&#x43A;&#x435;, &#x432;&#x44B; &#x443;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x434;&#x435;&#x442;&#x44C; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x435;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x432;&#x441;&#x435;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x432; &#x43A;&#x43E;&#x434;&#x435;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x431;&#x44B;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x438;&#x43D;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x44B;/&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x44B; &#x434;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430;, &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x443;&#x432;&#x438;&#x434;&#x435;&#x442;&#x44C; call stack, &#x442;&#x435;&#x43A;&#x443;&#x449;&#x438;&#x439; scope, event listeners &#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x435; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x435;.</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x43F;&#x43E; &#x445;&#x43E;&#x434;&#x443; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x434;&#x430; &#x432; &#x442;&#x43E;&#x447;&#x43A;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x430; &#x432;&#x44B; &#x443;&#x432;&#x438;&#x434;&#x435;&#x43B;&#x438;, &#x447;&#x442;&#x43E; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x443;&#x44E;&#x449;&#x430;&#x44F; &#x432;&#x430;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x43D;&#x435; &#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x432;&#x44B; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x43B;&#x438; &#x442;&#x430;&#x43C; &#x443;&#x432;&#x438;&#x434;&#x435;&#x442;&#x44C;, &#x442;&#x43E; &#x432;&#x43E; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x435; <em>Call Stack</em> &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; <em>&#x43F;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;</em> &#x43F;&#x43E; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x430;&#x43C;, &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C;, &#x43A;&#x430;&#x43A; &#x43C;&#x435;&#x43D;&#x44F;&#x43B;&#x441;&#x44F; scope &#x43E;&#x442; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x430; &#x43A; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x443;.</p>
<p>&#x422;&#x430;&#x43A; &#x436;&#x435; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43B;&#x435;&#x434;&#x438;&#x442;&#x44C; &#x437;&#x430; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x438;&#x43B;&#x438; &#x434;&#x430;&#x436;&#x435; &#x446;&#x435;&#x43B;&#x44B;&#x445; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x432;&#x44B;&#x437;&#x43E;&#x432; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x441; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;) &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x432; &#x438;&#x445; &#x432; &#x441;&#x435;&#x43A;&#x446;&#x438;&#x44E; watch:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-02-1613-jvxodrg43i.gif" alt=""></p>
<p>&#x41F;&#x43E; &#x445;&#x43E;&#x434;&#x443; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x434;&#x430;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x435;&#x43C;&#x44B;&#x445; &#x432;&#x430;&#x43C;&#x438; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x445; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C;&#x441;&#x44F;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442; &#x432;&#x430;&#x43C; &#x43E;&#x442;&#x43B;&#x43E;&#x432;&#x438;&#x442;&#x44C; &#x442;&#x43E;&#x442; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;, &#x433;&#x434;&#x435; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43F;&#x43E;&#x448;&#x43B;&#x43E; &#x43D;&#x435; &#x442;&#x430;&#x43A;.</p>
<p>&#x422;&#x430;&#x43A; &#x436;&#x435; &#x442;&#x43E;&#x447;&#x43A;&#x438; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43D;&#x430; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43A;&#x435; &#x43A;&#x43E;&#x434;&#x430;, &#x43D;&#x43E; &#x435;&#x449;&#x435; &#x438; &#x43D;&#x430; &#x43D;&#x430;:</p>
<ul>
<li>XHR &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x430;&#x445;;</li>
<li>DOM-&#x43D;&#x43E;&#x434;&#x430;&#x445;;</li>
<li>Event Listeners.</li>
</ul>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x434;&#x438;&#x442;&#x44C; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x432; DOM-&#x43D;&#x43E;&#x434;&#x435;, &#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x430;&#x439;&#x434;&#x438;&#x442;&#x435; &#x435;&#x433;&#x43E; &#x432;&#x43E; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x435; <em>Elements</em> &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x438; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x432;&#x44B;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x43D;&#x430; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x435;, &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x438;&#x442;&#x435; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x43D;&#x43E;&#x435; &#x43C;&#x435;&#x43D;&#x44E; &#x43D;&#x430; &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43E;&#x43C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x435; &#x438; &#x432;&#x44B; &#x443;&#x432;&#x438;&#x434;&#x438;&#x442;&#x435; &#x43F;&#x443;&#x43D;&#x43A;&#x442; &#x43C;&#x435;&#x43D;&#x44E; <em>Break on...</em>:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-03-1042-qrlc3ap6ba.png" alt=""></p>
<p>&#x417;&#x434;&#x435;&#x441;&#x44C; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x443;&#x44E; &#x432;&#x430;&#x43C; &#x442;&#x43E;&#x447;&#x43A;&#x443; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x430;, &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x430; &#x43D;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x432;&#x44B; &#x441;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x43A;&#x430;&#x43A;&#x43E;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x43B; &#x43A; &#x442;&#x43E;&#x43C;&#x443; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x43E;&#x43C;&#x443; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44E; DOM-&#x43D;&#x43E;&#x434;&#x44B;.</p>
<p>&#x422;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43B;&#x438;&#x448;&#x44C; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x438; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x442;&#x43E;&#x447;&#x435;&#x43A; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x440;&#x430;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x43E;&#x433;&#x440;&#x43E;&#x43C;&#x43D;&#x44B;&#x43C; &#x441;&#x43F;&#x435;&#x43A;&#x442;&#x440;&#x43E;&#x43C; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;, &#x441;&#x430;&#x43C;&#x43E;&#x435; &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x435; - &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x438;&#x43C;&#x435;&#x44E;&#x449;&#x438;&#x43C;&#x438;&#x441;&#x44F; &#x443; &#x432;&#x430;&#x441; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;.</p>
<h2 id="&#x43F;&#x43E;&#x438;&#x441;&#x43A;-&#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;-&#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;">&#x41F;&#x43E;&#x438;&#x441;&#x43A; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;</h2>
<p>&#x412; Chrome Dev Tools &#x442;&#x430;&#x43A; &#x436;&#x435; &#x435;&#x441;&#x442;&#x44C; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x44B; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x432;&#x44B;&#x437;&#x432;&#x430;&#x43D;&#x44B; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x43C;&#x438; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x430;&#x43C;&#x438;, &#x43D;&#x43E; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x438;&#x437; &#x43D;&#x438;&#x445;: &#x447;&#x430;&#x441;&#x442;&#x44B;&#x435; reflow &#x438; &#x43D;&#x435;&#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430; &#x441; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x44C;&#x44E;.</p>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x443; &#x43D;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x442;&#x43E;&#x440;&#x43C;&#x43E;&#x437;&#x438;&#x442;:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-02-1654-livyima8w7.gif" alt=""></p>
<p>&#x41C;&#x44B; &#x432;&#x438;&#x434;&#x438;&#x43C;, &#x447;&#x442;&#x43E; frame rate &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x43B;&#x435;&#x431;&#x43B;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x440;&#x430;&#x439;&#x43E;&#x43D;&#x435; 18 &#x43A;&#x430;&#x434;&#x440;&#x43E;&#x432; &#x432; &#x441;&#x435;&#x43A;&#x443;&#x43D;&#x434;&#x443;, &#x430; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x441; frame rate &#x432; 60 &#x43A;&#x430;&#x434;&#x440;&#x43E;&#x432; &#x432; &#x441;&#x435;&#x43A;&#x443;&#x43D;&#x434;&#x443;. &#x427;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442;, &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x432;&#x43E; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x443; Performance, &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; profile &#x440;&#x435;&#x43D;&#x434;&#x435;&#x440;&#x438;&#x43D;&#x433;&#x430; &#x43D;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-02-1701-n68a2ak4g0.png" alt=""></p>
<p>&#x41C;&#x44B; &#x432;&#x438;&#x434;&#x438;&#x43C;, &#x447;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x447;&#x430;&#x441;&#x442;&#x44B;&#x439; reflow, &#x430; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x443;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x442;&#x440;&#x430;&#x442;&#x438;&#x442; &#x43F;&#x440;&#x438; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; <code>app.update</code>, &#x43F;&#x43B;&#x44E;&#x441; &#x43A; &#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x440;&#x44F;&#x43C;&#x43E; &#x438;&#x437; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x438; <em>Activity</em> &#x43F;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x43D;&#x430; 62 &#x441;&#x440;&#x43E;&#x43A;&#x443; app.js &#x438; &#x443;&#x432;&#x438;&#x434;&#x435;&#x442;&#x44C; &#x442;&#x430;&#x43C; &#x437;&#x430;&#x442;&#x440;&#x430;&#x442;&#x44B; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x43D;&#x430; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43A;&#x438; &#x43A;&#x43E;&#x434;&#x430;:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-02-1703-2antpx94r6.png" alt=""></p>
<p>&#x41C;&#x44B; &#x432;&#x438;&#x434;&#x438;&#x43C; &#x437;&#x434;&#x435;&#x441;&#x44C;, &#x447;&#x442;&#x43E; &#x432; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43A;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; <code>offsetTop</code>, &#x447;&#x442;&#x43E; &#x438; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; reflow &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B;. &#x418;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x432; &#x44D;&#x442;&#x43E;, &#x43C;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x43C; &#x437;&#x430;&#x432;&#x435;&#x442;&#x43D;&#x44B;&#x435; 60 &#x43A;&#x430;&#x434;&#x440;&#x43E;&#x432; &#x432; &#x441;&#x435;&#x43A;&#x443;&#x43D;&#x434;&#x443;, &#x430; &#x43D;&#x430;&#x448;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; <code>app.update</code> &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442; &#x43E;&#x43A;&#x43E;&#x43B;&#x43E; 10% &#x43E;&#x442; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x437;&#x430;&#x442;&#x440;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438;:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-02-1711-dbajgan50h.png" alt=""></p>
<p>&#x427;&#x442;&#x43E;&#x431;&#x44B; &#x431;&#x44B;&#x43B;&#x43E; &#x43F;&#x440;&#x43E;&#x449;&#x435; &#x431;&#x43E;&#x440;&#x43E;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x43B;&#x438;&#x448;&#x43D;&#x438;&#x43C;&#x438; reflow, &#x432;&#x43E;&#x442; <a href="https://gist.github.com/paulirish/5d52fb081b3570c81e3a" target="_blank">&#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A;</a> &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x435;&#x433;&#x43E; &#x432;&#x44B;&#x437;&#x432;&#x430;&#x442;&#x44C;.</p>
<p>&#x418;&#x43D;&#x43E;&#x433;&#x434;&#x430; &#x431;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x442;&#x43E;&#x43D;&#x43A;&#x43E; &#x43F;&#x43E;&#x43F;&#x440;&#x43E;&#x444;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x434;&#x430;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x437;&#x430;&#x43C;&#x435;&#x440;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x43E;&#x432; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x432; &#x43A;&#x430;&#x43A;&#x43E;&#x439;-&#x442;&#x43E; &#x435;&#x433;&#x43E; &#x447;&#x430;&#x441;&#x442;&#x438;. &#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; <code>console.profile</code> &#x438; <code>console.profileEnd</code>. &#x41C;&#x435;&#x436;&#x434;&#x443; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x430;&#x43C;&#x438; &#x44D;&#x442;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x432; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x444;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;, &#x441;&#x43E;&#x431;&#x440;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43F;&#x440;&#x43E;&#x444;&#x438;&#x43B;&#x44C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x432;&#x43E; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x435; <em>Performance</em>.</p>
<h2 id="&#x43F;&#x43E;&#x438;&#x441;&#x43A;-&#x443;&#x442;&#x435;&#x447;&#x435;&#x43A;-&#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;">&#x41F;&#x43E;&#x438;&#x441;&#x43A; &#x443;&#x442;&#x435;&#x447;&#x435;&#x43A; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;</h2>
<p>&#x412; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x432;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x443;&#x442;&#x435;&#x447;&#x43A;&#x443; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x443;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;. &#x421;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x438; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x432;&#x443;&#x445; Heap Spanshot. &#x41F;&#x435;&#x440;&#x435;&#x439;&#x434;&#x438;&#x442;&#x435; &#x432;&#x43E; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x443; <em>Memory</em>, &#x432;&#x44B;&#x431;&#x435;&#x440;&#x438;&#x442;&#x435; &#x43E;&#x43F;&#x446;&#x438;&#x44E; <em>Take heap spanshot</em>, &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x447;&#x435;&#x433;&#x43E; &#x43D;&#x430;&#x436;&#x43C;&#x438;&#x442;&#x435; &#x43D;&#x430; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x443; <em>Take spanshot</em></p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-03-1114-kpbwoh8u6i.png" alt=""></p>
<p>&#x412; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43D;&#x435;&#x43F;&#x448;&#x43E;&#x442;&#x435; &#x432;&#x44B; &#x441;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x443;&#x432;&#x438;&#x434;&#x435;&#x442;&#x44C; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x438;&#x439; &#x441;&#x440;&#x435;&#x437; &#x43A;&#x443;&#x447;&#x438; js, &#x430; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x447;&#x442;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x43E; &#x432; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-03-1117-66j5rww2dk.png" alt=""></p>
<p>&#x41D;&#x43E; &#x44D;&#x442;&#x43E; &#x435;&#x449;&#x435; &#x43D;&#x435; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442; &#x43E; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x437;&#x434;&#x435;&#x441;&#x44C; &#x435;&#x441;&#x442;&#x44C; &#x443;&#x442;&#x435;&#x447;&#x43A;&#x430;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x443;&#x442;&#x435;&#x447;&#x43A;&#x443; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x438;&#x43A;&#x435;, &#x442;&#x43E; &#x43D;&#x430;&#x43C; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x43F;&#x43E;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x441; &#x43D;&#x430;&#x448;&#x438;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x435;&#x449;&#x435; &#x43A;&#x430;&#x43A;&#x43E;&#x435;-&#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F;, &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x447;&#x435;&#x433;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x441;&#x43D;&#x435;&#x43F;&#x448;&#x43E;&#x442; &#x438; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x438;&#x442;&#x44C; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x441;&#x43D;&#x435;&#x43F;&#x448;&#x43E;&#x442; &#x441; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x43C;:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-03-1122-v7qkhuz3is.gif" alt=""></p>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43C;&#x44B; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x435;&#x43C;, &#x447;&#x442;&#x43E; &#x443;&#x442;&#x435;&#x447;&#x43A;&#x430; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x435;&#x441;&#x442;&#x44C;, &#x437;&#x43D;&#x430;&#x435;&#x43C; &#x447;&#x442;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; <em>&#x437;&#x430;&#x431;&#x438;&#x432;&#x430;&#x435;&#x442;</em> &#x43D;&#x430;&#x448; heap, &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x43C;&#x435;&#x441;&#x442;&#x43E; &#x432; &#x43A;&#x43E;&#x434;&#x435;, &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x435;&#x435; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443; &#x438; &#x43F;&#x43E;&#x444;&#x438;&#x43A;&#x441;&#x438;&#x442;&#x44C; &#x435;&#x433;&#x43E;.</p>
<p>&#x421;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x432;&#x43E;&#x437;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x44C;, &#x435;&#x441;&#x43B;&#x438; &#x443;&#x442;&#x435;&#x447;&#x435;&#x43A; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;. &#x412; &#x44D;&#x442;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43F;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44F; &#x448;&#x430;&#x433; &#x437;&#x430; &#x448;&#x430;&#x433;&#x43E;&#x43C; &#x43E;&#x442;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x43E;&#x437;&#x440;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x430; &#x432; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x438;&#x43A;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x439; &#x438; &#x438;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x432; &#x43A;&#x43E;&#x434;&#x435;. &#x415;&#x441;&#x43B;&#x438; &#x436;&#x435; &#x443;&#x442;&#x435;&#x447;&#x43A;&#x430; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x435;&#x441;&#x442;&#x44C;, &#x43D;&#x43E; &#x43E;&#x43D;&#x430; &#x43D;&#x435; &#x441;&#x442;&#x43E;&#x43B;&#x44C; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x430;, &#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43F;&#x44B;&#x442;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443;, &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x447;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x434; &#x438; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x441;&#x43D;&#x435;&#x43F;&#x448;&#x43E;&#x442;&#x44B; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x432;&#x43D;&#x435;&#x441;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x438;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439;. &#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x445; &#x438;&#x442;&#x435;&#x440;&#x430;&#x446;&#x438;&#x439; &#x443; &#x432;&#x430;&#x441; &#x431;&#x443;&#x434;&#x435;&#x442; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x435; &#x43A;&#x43E;&#x43B;-&#x432;&#x43E; &#x441;&#x43D;&#x435;&#x43F;&#x448;&#x43E;&#x442;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x432;&#x430;&#x448;&#x438;&#x445; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x439;.</p>
<p>&#x415;&#x441;&#x43B;&#x438; &#x436;&#x435; &#x443;&#x442;&#x435;&#x447;&#x43A;&#x430; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x44F;&#x440;&#x43A;&#x43E; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x430;, &#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C; <em>Memory Allocation Profile</em>, &#x433;&#x434;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x432;&#x438;&#x434;&#x435;&#x442;&#x44C; &#x43C;&#x435;&#x441;&#x442;&#x43E; &#x432; &#x43A;&#x43E;&#x434;&#x435;, &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x44F;&#x449;&#x435;&#x435; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x435; &#x43A;&#x43E;&#x43B;-&#x432;&#x43E; &#x430;&#x43B;&#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x439;:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-03-1132-xplr2oyc1n.png" alt=""></p>
<h2 id="&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;-&#x441;-&#x441;&#x435;&#x442;&#x44C;&#x44E;">&#x420;&#x430;&#x431;&#x43E;&#x442;&#x430; &#x441; &#x441;&#x435;&#x442;&#x44C;&#x44E;</h2>
<p>&#x418;&#x43D;&#x43E;&#x433;&#x434;&#x430; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x44B;&#x44F;&#x432;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443;, &#x441;&#x432;&#x44F;&#x437;&#x430;&#x43D;&#x43D;&#x443;&#x44E; &#x441; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x441;&#x435;&#x442;&#x435;&#x432;&#x44B;&#x445; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;. &#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x43E;&#x439; <em>Network</em>. &#x417;&#x434;&#x435;&#x441;&#x44C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x443;&#x44E; &#x432;&#x430;&#x43C; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x441;&#x442;&#x44C; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F;, &#x432;&#x44B;&#x431;&#x440;&#x430;&#x432; &#x438;&#x437; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x444;&#x438;&#x43B;&#x435;&#x439; &#x438;&#x43B;&#x438; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x432; &#x441;&#x432;&#x43E;&#x439; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439;, &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x43B;&#x43E;&#x433; &#x441;&#x435;&#x442;&#x435;&#x432;&#x44B;&#x445; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;, &#x43E;&#x442;&#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43D;&#x44B;&#x445; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432; &#x438; &#x442;&#x430;&#x43A; &#x434;&#x430;&#x43B;&#x435;&#x435;. </p>
<p>&#x41B;&#x43E;&#x433; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432; &#x442;&#x43E;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43A;&#x430;&#x441;&#x442;&#x43E;&#x43C;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;. &#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43E; &#x43F;&#x43E; &#x434;&#x435;&#x444;&#x43E;&#x43B;&#x442;&#x443;, &#x435;&#x441;&#x442;&#x44C; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x441;&#x43A;&#x440;&#x44B;&#x442;&#x430;, &#x43D;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x43E;&#x43C;&#x43E;&#x447;&#x44C; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x435; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x44B;:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-03-1205-c933e1ukls.png" alt=""></p>
<p>&#x422;&#x430;&#x43A; &#x436;&#x435; &#x433;&#x440;&#x430;&#x444;&#x438;&#x43A; <em>Waterfall</em> &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x442;&#x430; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430;, &#x43D;&#x43E; &#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x432;&#x435;&#x449;&#x438;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44F; <em>Total Duration</em>, &#x447;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x44B;&#x43C; &#x43F;&#x440;&#x438; &#x432;&#x44B;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x438; &#x441;&#x435;&#x442;&#x435;&#x432;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-03-1207-epj7juunm4.png" alt=""></p>
<p>&#x41D;&#x43E; &#x438;&#x43D;&#x43E;&#x433;&#x434;&#x430; &#x431;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x432;&#x44B;&#x434;&#x430;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x439; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x437;&#x430; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439;. &#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x432; More Tools &gt; Nework Conditions, &#x433;&#x434;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x432;&#x44B;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x441;&#x442;&#x44C; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F;, &#x43E;&#x442;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x44C;/&#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x44C; &#x43A;&#x44D;&#x448;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;, &#x43D;&#x43E; &#x435;&#x449;&#x435; &#x438; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; User Agent &#x434;&#x43B;&#x44F; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x442;&#x44C; User Agent &#x438;&#x437; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x430;, &#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x439; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439;:</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-03-1154-wacrdcz6dp.png" alt=""></p>
<p>&#x42D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x43E;, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43E;&#x441;&#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x443;, &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43D;&#x443;&#x44E; &#x432; &#x440;&#x435;&#x434;&#x43A;&#x43E;&#x43C; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435;.</p>
<p>&#x422;&#x430;&#x43A; &#x436;&#x435; &#x431;&#x44B;&#x432;&#x430;&#x44E;&#x442; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x438;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;&#x43C;, &#x435;&#x441;&#x43B;&#x438; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x441;&#x435;&#x442;&#x435;&#x432;&#x43E;&#x439; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43D;&#x435; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x441;&#x44F; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435;. &#x42D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x432; More Tools &gt; Request blocking.</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-03-1157-x90m7erfqm.png" alt=""></p>
<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D;&#x430; &#x431;&#x43B;&#x43E;&#x43A;&#x438;&#x440;&#x43E;&#x432;&#x43A;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x432;&#x438;&#x434;&#x435;&#x442;&#x44C; &#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432; &#x431;&#x44B;&#x43B;&#x43E; &#x437;&#x430;&#x431;&#x43B;&#x43E;&#x43A;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43E;.</p>
<h2 id="&#x43E;&#x431;&#x449;&#x438;&#x439;-&#x43F;&#x43E;&#x438;&#x441;&#x43A;-&#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;">&#x41E;&#x431;&#x449;&#x438;&#x439; &#x43F;&#x43E;&#x438;&#x441;&#x43A; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;</h2>
<p>&#x41D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x432; Chrome Dev Tools &#x435;&#x441;&#x442;&#x44C; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;, &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x439; &#x441;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x442;&#x435;&#x43D;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;. &#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x434;&#x438;&#x442;&#x435; &#x432;&#x43E; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x443; <em>Adutids</em> &#x438; &#x43D;&#x430;&#x436;&#x43C;&#x438;&#x442;&#x435; <em>Perform and audit</em>, &#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x435; &#x432;&#x44B; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x435; &#x43A;&#x440;&#x430;&#x439;&#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x44B;&#x439; &#x43E;&#x442;&#x447;&#x435;&#x442; &#x43E; &#x43F;&#x43E;&#x442;&#x435;&#x43D;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430;&#x445; &#x43D;&#x430; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x441;&#x430;&#x439;&#x442;&#x435;. &#x41E;&#x43D; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x441;&#x445;&#x43E;&#x436; &#x441; Google Page Speed, &#x43D;&#x43E; &#x435;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;</p>
<p><img src="http://s.csssr.ru/U286BQJEP/2017-10-03-1221-17dpuftz1a.gif" alt=""></p>
<h2 id="&#x438;&#x442;&#x43E;&#x433;">&#x418;&#x442;&#x43E;&#x433;</h2>
<p>&#x417;&#x434;&#x435;&#x441;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x44B; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x441;&#x446;&#x435;&#x43D;&#x430;&#x440;&#x438;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; Chrome Dev Tools, &#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x434;&#x430;&#x43B;&#x435;&#x43A;&#x43E; &#x43D;&#x435; &#x43F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x440;&#x435;&#x448;&#x430;&#x435;&#x442;&#x435; &#x43A;&#x430;&#x43A;&#x443;&#x44E;-&#x442;&#x43E; &#x437;&#x430;&#x434;&#x430;&#x447;&#x443;, &#x442;&#x43E; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x439;&#x442;&#x435; &#x43D;&#x430;&#x439;&#x442;&#x438; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x44F;&#x449;&#x435;&#x435; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x43E; &#x434;&#x43B;&#x44F; &#x435;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x432; Chrome Dev Tools, &#x43D;&#x435; &#x43C;&#x443;&#x447;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44C; &#x441; <code>console.log</code>, &#x440;&#x435;&#x448;&#x430;&#x439;&#x442;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438; &#x442;&#x435;&#x43C;&#x438; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430;&#x43C;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44B; &#x434;&#x43B;&#x44F; &#x438;&#x445; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Testing.html" class="navigation navigation-prev " aria-label="Previous page: Testing">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ESNext/Readme.html" class="navigation navigation-next " aria-label="Next page: ESNext">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Debug","level":"1.4.3","depth":2,"next":{"title":"ESNext","level":"1.4.4","depth":2,"path":"JavaScript/ESNext/Readme.md","ref":"./JavaScript/ESNext/Readme.md","articles":[{"title":"ES2015","level":"1.4.4.1","depth":3,"path":"JavaScript/ESNext/ES2015.md","ref":"./JavaScript/ESNext/ES2015.md","articles":[]},{"title":"ES2016","level":"1.4.4.2","depth":3,"path":"JavaScript/ESNext/ES2016.md","ref":"./JavaScript/ESNext/ES2016.md","articles":[]}]},"previous":{"title":"Testing","level":"1.4.2","depth":2,"path":"JavaScript/Testing.md","ref":"./JavaScript/Testing.md","articles":[]},"dir":"ltr"},"config":{"plugins":["edit-link","prism","-highlight","github","anchorjs"],"root":"./docs","styles":{"website":"build/gitbook.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/CSSSR/sputnik"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Edit This Page","base":"https://github.com/CSSSR/sputnik/blob/master/docs"},"theme-default":{"styles":{"website":"build/gitbook.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchorjs":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Sputnik","gitbook":">=3.2.1"},"file":{"path":"JavaScript/Debug.md","mtime":"2018-04-02T09:07:44.540Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-02T11:36:38.053Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/anchor-js/4.1.0/anchor.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-anchorjs/anchor-style.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

