
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>ESNext · Sputnik</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ES2015.html" />
    
    
    <link rel="prev" href="../Debug.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">Оглавление</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../HTML/Readme.html">
            
                <a href="../../HTML/Readme.html">
            
                    
                    HTML
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../CSS/Readme.html">
            
                <a href="../../CSS/Readme.html">
            
                    
                    CSS
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../../CSS/Methodology/Readme.html">
            
                <a href="../../CSS/Methodology/Readme.html">
            
                    
                    Методологии
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="../../CSS/Methodology/BEM.html">
            
                <a href="../../CSS/Methodology/BEM.html">
            
                    
                    BEM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="../../CSS/Methodology/CSSModules.html">
            
                <a href="../../CSS/Methodology/CSSModules.html">
            
                    
                    CSS Modules
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../Readme.html">
            
                <a href="../Readme.html">
            
                    
                    JavaScript
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../Perfomance.html">
            
                <a href="../Perfomance.html">
            
                    
                    Perfomance
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../Testing.html">
            
                <a href="../Testing.html">
            
                    
                    Testing
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../Debug.html">
            
                <a href="../Debug.html">
            
                    
                    Debug
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.4" data-path="Readme.html">
            
                <a href="Readme.html">
            
                    
                    ESNext
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.4.1" data-path="ES2015.html">
            
                <a href="ES2015.html">
            
                    
                    ES2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4.2" data-path="ES2016.html">
            
                <a href="ES2016.html">
            
                    
                    ES2016
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../../Git/Readme.html">
            
                <a href="../../Git/Readme.html">
            
                    
                    Git
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../../Git/Convention.html">
            
                <a href="../../Git/Convention.html">
            
                    
                    Convention
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../../Git/Workflow.html">
            
                <a href="../../Git/Workflow.html">
            
                    
                    Workflow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../../Git/Advices.html">
            
                <a href="../../Git/Advices.html">
            
                    
                    Advices
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../../Git/PullRequests.html">
            
                <a href="../../Git/PullRequests.html">
            
                    
                    Pull Requests
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../../Common/UsefulLinks.html">
            
                <a href="../../Common/UsefulLinks.html">
            
                    
                    Полезные ссылки
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../../Common/CodeEditors.html">
            
                <a href="../../Common/CodeEditors.html">
            
                    
                    Плагины для вашего редактора
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >ESNext</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="esnext">ESNext</h1>
<p>&#x412; 2015 &#x433;&#x43E;&#x434;&#x443; &#x432;&#x44B;&#x448;&#x435;&#x43B; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442; JS, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43E;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43E;&#x433;&#x440;&#x43E;&#x43C;&#x43D;&#x43E;&#x435;
&#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x439;. &#x411;&#x43E;&#x43B;&#x44C;&#x448;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x439; &#x43D;&#x435; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;
&#x43D;&#x43E;&#x432;&#x44B;&#x435; &#x432;&#x435;&#x449;&#x438;, &#x430; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x439; &#x441;&#x430;&#x445;&#x430;&#x440;.
&#x422;&#x430;&#x43A;&#x436;&#x435; &#x441;&#x43C;&#x435;&#x43D;&#x438;&#x43B;&#x441;&#x44F; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; &#x438;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x439; &#x438; &#x43F;&#x43E;&#x44F;&#x432;&#x438;&#x43B;&#x441;&#x44F; &#x44F;&#x432;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A;
&#x43F;&#x43E;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x430;&#x43A;&#x438;&#x445;-&#x442;&#x43E; &#x43D;&#x43E;&#x432;&#x44B;&#x445; &#x432;&#x435;&#x449;&#x435;&#x439;:</p>
<ul>
<li>&#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x433;&#x43E;&#x434; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x430;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442;
&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x43D;&#x430;&#x431;&#x43E;&#x440; &#x444;&#x438;&#x447;. &#x412;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x438;&#x43C;&#x435;&#x43D;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x433;&#x43E;&#x434;&#x43E;&#x43C; &#x432;&#x44B;&#x43F;&#x443;&#x441;&#x43A;&#x430;
(&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, ES6 &#x2014; &#x44D;&#x442;&#x43E; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x435; &#x438;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;, &#x43F;&#x43E; &#x43D;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x2014; ES2015.
&#x422;&#x430;&#x43A;&#x436;&#x435; &#x443;&#x436;&#x435; &#x443;&#x436;&#x435; &#x432;&#x44B;&#x448;&#x43B;&#x430; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; ES2016 &#x438; &#x442;&#x430;&#x43A; &#x434;&#x430;&#x43B;&#x435;&#x435;);</li>
<li>Stage-4 &#x2014; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x43E; &#x434;&#x43B;&#x44F; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;;</li>
<li>Stage-3 &#x2014; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x43E;, &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x43F;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x432; stage-4
&#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43D;&#x435;&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x44B;&#x445; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x439;;</li>
<li>Stage-2 &#x2014; &#x447;&#x435;&#x440;&#x43D;&#x43E;&#x432;&#x438;&#x43A; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x43F;&#x435;&#x440;&#x432;&#x430;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x435;;</li>
<li>Stage-1 &#x2014; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x430; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x430; &#x440;&#x435;&#x448;&#x430;&#x435;&#x43C;&#x430;&#x44F; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430;,
&#x438;&#x434;&#x435;&#x44F; &#x43F;&#x440;&#x438;&#x43E;&#x431;&#x440;&#x435;&#x442;&#x430;&#x435;&#x442; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x444;&#x43E;&#x440;&#x43C;&#x443;;</li>
<li>Stage-0 &#x2014; &#x43A;&#x430;&#x43A;&#x438;&#x435;-&#x442;&#x43E; &#x438;&#x434;&#x435;&#x438; &#x432; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x435;.
<a href="http://www.2ality.com/2015/11/tc39-process.html" target="_blank">&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x435;&#x435; &#x43E; &#x441;&#x442;&#x430;&#x442;&#x443;&#x441;&#x430;&#x445;</a>
&#x427;&#x435;&#x43C; &#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;, &#x442;&#x435;&#x43C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x448;&#x430;&#x43D;&#x441;&#x43E;&#x432;, &#x447;&#x442;&#x43E; &#x432; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x43C; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x432; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438;
&#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43F;&#x43E;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x438; &#x431;&#x443;&#x434;&#x443;&#x442; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x435;.
&#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x441;&#x442;&#x43E;&#x438;&#x442; &#x437;&#x430;&#x434;&#x443;&#x43C;&#x44B;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x431; &#x44D;&#x442;&#x43E;&#x43C; &#x43F;&#x440;&#x438; &#x432;&#x44B;&#x431;&#x43E;&#x440;&#x435; &#x444;&#x438;&#x447;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F;.</li>
</ul>
<p>&#x422;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x435;&#x449;&#x435; &#x43D;&#x435; &#x432;&#x435;&#x441;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B; &#x43D;&#x43E;&#x432;&#x44B;&#x445; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43E;&#x432; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x43C;&#x438;,
&#x442;&#x43E; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x434;&#x430; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x443;&#x435;&#x442; &#x43A;&#x43E;&#x434; &#x43F;&#x43E; &#x43D;&#x43E;&#x432;&#x43E;&#x43C;&#x443;
&#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x443; &#x432; &#xAB;&#x441;&#x442;&#x430;&#x440;&#x44B;&#x439;&#xBB; &#x43A;&#x43E;&#x434; (&#x44D;&#x442;&#x43E;&#x442; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441; &#x43D;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x442;&#x440;&#x430;&#x43D;&#x441;&#x43F;&#x430;&#x439;&#x43B;&#x438;&#x43D;&#x433;&#x43E;&#x43C;).
&#x42D;&#x442;&#x43E; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43B;&#x438;&#x448;&#x44C; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445; &#x432;&#x435;&#x449;&#x435;&#x439;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x445;&#x430;&#x440;&#x43E;&#x43C;.
&#x41D;&#x43E; &#x432; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x430;&#x445; &#x431;&#x44B;&#x432;&#x430;&#x44E;&#x442; &#x432;&#x435;&#x449;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x431;&#x435;&#x437; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; &#x446;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x43C;
&#x432;&#x43E;&#x441;&#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;.
&#x422;&#x430;&#x43A;&#x438;&#x43C; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; <a href="https://babeljs.io/" target="_blank">Babel</a>.
&#x412; &#x435;&#x433;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x430;&#x445; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x44F;&#x437;&#x44B;&#x43A;&#x430; &#x438;&#x43B;&#x438; &#x43D;&#x43E;&#x43C;&#x435;&#x440;&#x430; stage,
&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C;. &#x418;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438;.
&#x421;&#x442;&#x43E;&#x438;&#x442; &#x443;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C;, &#x447;&#x442;&#x43E; Babel &#x442;&#x440;&#x430;&#x43D;&#x441;&#x43F;&#x430;&#x439;&#x43B;&#x438;&#x442; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x438;,
&#x43D;&#x43E; &#x43D;&#x435; &#x43F;&#x43E;&#x43B;&#x438;&#x444;&#x438;&#x43B;&#x438;&#x442; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x434;&#x430;&#x436;&#x435; &#x43F;&#x440;&#x438;
&#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; ES2016 &#x432;&#x44B;&#x437;&#x432;&#x430;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Array.prototype.includes</code>,
&#x442;&#x43E; &#x435;&#x433;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432; &#x441;&#x442;&#x430;&#x440;&#x44B;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;.
&#x414;&#x43B;&#x44F; &#x43F;&#x43E;&#x43B;&#x438;&#x444;&#x438;&#x43B;&#x438;&#x43D;&#x433;&#x430; &#x435;&#x441;&#x442;&#x44C; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; <a href="https://babeljs.io/docs/usage/polyfill/" target="_blank">babel-polyfill</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../Debug.html" class="navigation navigation-prev " aria-label="Previous page: Debug">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ES2015.html" class="navigation navigation-next " aria-label="Next page: ES2015">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"ESNext","level":"1.4.4","depth":2,"next":{"title":"ES2015","level":"1.4.4.1","depth":3,"path":"JavaScript/ESNext/ES2015.md","ref":"./JavaScript/ESNext/ES2015.md","articles":[]},"previous":{"title":"Debug","level":"1.4.3","depth":2,"path":"JavaScript/Debug.md","ref":"./JavaScript/Debug.md","articles":[]},"dir":"ltr"},"config":{"plugins":["edit-link","prism","-highlight","github","anchorjs"],"root":"./docs","styles":{"website":"build/gitbook.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/CSSSR/sputnik"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Edit This Page","base":"https://github.com/CSSSR/sputnik/blob/master/docs"},"theme-default":{"styles":{"website":"build/gitbook.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchorjs":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Sputnik","gitbook":">=3.2.1"},"file":{"path":"JavaScript/ESNext/Readme.md","mtime":"2018-04-02T09:07:44.544Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-02T11:36:38.053Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/anchor-js/4.1.0/anchor.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-anchorjs/anchor-style.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

