
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Полезные ссылки · Sputnik</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="CodeEditors.html" />
    
    
    <link rel="prev" href="../Git/PullRequests.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">Оглавление</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../HTML/Readme.html">
            
                <a href="../HTML/Readme.html">
            
                    
                    HTML
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../CSS/Readme.html">
            
                <a href="../CSS/Readme.html">
            
                    
                    CSS
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../CSS/Methodology/Readme.html">
            
                <a href="../CSS/Methodology/Readme.html">
            
                    
                    Методологии
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="../CSS/Methodology/BEM.html">
            
                <a href="../CSS/Methodology/BEM.html">
            
                    
                    BEM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="../CSS/Methodology/CSSModules.html">
            
                <a href="../CSS/Methodology/CSSModules.html">
            
                    
                    CSS Modules
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../JavaScript/Readme.html">
            
                <a href="../JavaScript/Readme.html">
            
                    
                    JavaScript
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../JavaScript/Perfomance.html">
            
                <a href="../JavaScript/Perfomance.html">
            
                    
                    Perfomance
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../JavaScript/Testing.html">
            
                <a href="../JavaScript/Testing.html">
            
                    
                    Testing
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../JavaScript/Debug.html">
            
                <a href="../JavaScript/Debug.html">
            
                    
                    Debug
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../JavaScript/ESNext/Readme.html">
            
                <a href="../JavaScript/ESNext/Readme.html">
            
                    
                    ESNext
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.4.1" data-path="../JavaScript/ESNext/ES2015.html">
            
                <a href="../JavaScript/ESNext/ES2015.html">
            
                    
                    ES2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4.2" data-path="../JavaScript/ESNext/ES2016.html">
            
                <a href="../JavaScript/ESNext/ES2016.html">
            
                    
                    ES2016
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../Git/Readme.html">
            
                <a href="../Git/Readme.html">
            
                    
                    Git
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../Git/Convention.html">
            
                <a href="../Git/Convention.html">
            
                    
                    Convention
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../Git/Workflow.html">
            
                <a href="../Git/Workflow.html">
            
                    
                    Workflow
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../Git/Advices.html">
            
                <a href="../Git/Advices.html">
            
                    
                    Advices
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../Git/PullRequests.html">
            
                <a href="../Git/PullRequests.html">
            
                    
                    Pull Requests
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="UsefulLinks.html">
            
                <a href="UsefulLinks.html">
            
                    
                    Полезные ссылки
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="CodeEditors.html">
            
                <a href="CodeEditors.html">
            
                    
                    Плагины для вашего редактора
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Полезные ссылки</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x44B;&#x435;-&#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x438;">&#x41F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x44B;&#x435; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x438;</h1>
<ol>
<li><a href="https://developer.mozilla.org/en-US/" target="_blank">MDN</a> - &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x432;&#x441;&#x43F;&#x43E;&#x43D;&#x438;&#x442;&#x44C;/&#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x435; <code>this</code>, &#x447;&#x435;&#x43C; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; <code>bind</code> &#x43E;&#x442; <code>call</code>, &#x447;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x435; <code>clusure</code> &#x438; <code>hoisting</code>, &#x434;&#x430; &#x438; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435;, &#x447;&#x442;&#x43E;-&#x43B;&#x438;&#x431;&#x43E; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C; &#x43E; JS, &#x442;&#x43E; &#x441;&#x43C;&#x435;&#x43B;&#x43E; &#x438;&#x434;&#x438;&#x442;&#x435; &#x43D;&#x430; MDN, &#x44D;&#x442;&#x43E; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x43E;&#x43B;&#x43D;&#x430;&#x44F; &#x438; &#x43F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x430;&#x44F; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44F; &#x43F;&#x43E; JS &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;.</li>
<li><a href="https://caniuse.com/" target="_blank">Can I Use</a> - &#x437;&#x434;&#x435;&#x441;&#x44C; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x430;&#x43A;&#x43E;&#x435;-&#x43B;&#x438;&#x431;&#x43E; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x43E;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E;, API, CSS-&#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E; &#x432; &#x442;&#x43E;&#x43C; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x43E;&#x43C; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435;</li>
<li>&#x423;&#x437;&#x43D;&#x430;&#x442;&#x44C; &#x43A;&#x430;&#x43A; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; Chrome Devtools &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43D;&#x430; <a href="https://developer.chrome.com/devtools" target="_blank">developer.chrome.com</a>, &#x430; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x432; &#x43A;&#x443;&#x440;&#x441;&#x435; &#x43E;&#x442; <a href="https://www.codeschool.com/courses/discover-devtools" target="_blank">CodeShcool</a></li>
<li>Event Loop. &#x414;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x44C; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x443;&#x44E; &#x43F;&#x440;&#x438;&#x440;&#x43E;&#x434;&#x443; JS &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x440;&#x435;&#x441;&#x443;&#x440;&#x432;&#x430;&#x43C;&#x438;:<ul>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/EventLoop" target="_blank">MDN: Event Loop</a> - &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F; &#x43D;&#x430; MDN &#x43F;&#x440;&#x43E; Event Loop;</li>
<li><a href="https://www.youtube.com/watch?v=8aGhZQkoFbQ" target="_blank">Philip Roberts: What the heck is the event loop anyway? | JSConf EU 2014</a> - &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x434;&#x43E;&#x43A;&#x43B;&#x430;&#x434; &#x43E;&#x431; Event Loop &#x441; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x438;&#x43C;&#x438; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x430;&#x43C;&#x438;;</li>
<li><a href="https://jakearchibald.com/2015/tasks-microtasks-queues-and-schedules/" target="_blank">Tasks, microtasks, queues and schedules</a> - &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F; &#x441; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x438;&#x43C;&#x438; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x430;&#x43C;&#x438;, &#x43F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E; &#x440;&#x430;&#x437;&#x44A;&#x44F;&#x441;&#x43D;&#x44F;&#x44E;&#x449;&#x430;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443; Event Loop &#x441; &#x43E;&#x447;&#x435;&#x440;&#x435;&#x434;&#x44C;&#x44E; &#x437;&#x430;&#x434;&#x430;&#x447;;</li>
</ul>
</li>
<li>&#x41E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; JS. <strong>WARN</strong>, &#x43D;&#x435; &#x434;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x439;&#x442;&#x435; &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x438;&#x43C; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x430;&#x446;&#x438;&#x44F;&#x43C; 10 &#x440;&#x430;&#x437; &#x438;&#x445; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x432;. &#x418;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440; JS, JIT-&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440;, &#x432;&#x441;&#x435; &#x432; JS &#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F;, &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;, &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x43E;&#x442;&#x435;&#x440;&#x44F;&#x442;&#x44C; &#x430;&#x43A;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x43A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x442;&#x43E;&#x43D;&#x43A;&#x438;&#x435; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x43D;&#x443;&#x436;&#x43D;&#x44B; &#x43A;&#x440;&#x430;&#x439;&#x43D;&#x435; &#x440;&#x435;&#x434;&#x43A;&#x43E;, &#x435;&#x441;&#x43B;&#x438; &#x443; &#x432;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x442;&#x43E; &#x441;&#x43A;&#x43E;&#x440;&#x435;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E;, &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x432; &#x432;&#x430;&#x448;&#x435;&#x439; &#x431;&#x438;&#x437;&#x43D;&#x435;&#x441; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x435;, &#x43D;&#x43E; &#x442;&#x435;&#x43C; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x437;&#x43D;&#x430;&#x442;&#x44C; &#x43E; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x435;&#x43C;&#x430;&#x445; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x43D;&#x443;&#x436;&#x43D;&#x43E;:<ul>
<li><a href="https://mythbusters.js.org/#/" target="_blank">JS MythBusters</a> - &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x44B;&#x445; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x439; JS;</li>
<li><a href="https://www.youtube.com/watch?v=HPFARivHJRY&amp;t=1535s" target="_blank">&#x41F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C; JavaScript &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x43E;&#x434;&#x437;&#x43E;&#x440;&#x43D;&#x443;&#x44E; &#x442;&#x440;&#x443;&#x431;&#x443;</a> - &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x434;&#x43E;&#x43A;&#x43B;&#x430;&#x434; &#x412;&#x44F;&#x447;&#x435;&#x441;&#x43B;&#x430;&#x432;&#x430; &#x415;&#x433;&#x43E;&#x440;&#x43E;&#x432;&#x430; &#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; JS;</li>
<li><a href="http://mrale.ph/blog/2013/04/29/performance-tuning-as-weather-forecast.html" target="_blank">Performance tuning as the art of weather forecast</a> - &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F; &#x412;&#x44F;&#x447;&#x435;&#x441;&#x43B;&#x430;&#x432;&#x430; &#x415;&#x433;&#x43E;&#x440;&#x43E;&#x432;&#x430; &#x43E;&#x431; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;&#x445; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x421;&#x442;&#x430;&#x442;&#x44C;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x43F;&#x43E;&#x442;&#x435;&#x440;&#x44F;&#x430;&#x43B;&#x430; &#x441;&#x432;&#x43E;&#x44E; &#x430;&#x43A;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x43D;&#x43E; &#x43C;&#x44B;&#x441;&#x43B;&#x438;, &#x432;&#x44B;&#x441;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x432; &#x43D;&#x435;&#x439;, &#x432;&#x441;&#x435; &#x435;&#x449;&#x435; &#x430;&#x43A;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;;</li>
<li><a href="http://mrale.ph/blog/2015/04/12/jsunderhood.html" target="_blank">jsunderhood digest &#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x438; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;&#x445;</a> - &#x432;&#x441;&#x435; &#x442;&#x43E;&#x442; &#x436;&#x435; &#x412;&#x44F;&#x447;&#x435;&#x441;&#x43B;&#x430;&#x432; &#x415;&#x433;&#x43E;&#x440;&#x43E;&#x432; &#x43E;&#x442;&#x432;&#x435;&#x447;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B; &#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; JS;</li>
</ul>
</li>
<li>React.js. &#x421;&#x430;&#x43C; &#x43F;&#x43E; &#x441;&#x435;&#x431;&#x435; React - &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x430;&#x44F; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x441; &#x442;&#x43E;&#x447;&#x43A;&#x438; &#x437;&#x440;&#x435;&#x43D;&#x438;&#x44F; API &#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; API, &#x43D;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x44C;, &#x43A;&#x430;&#x43A; React &#x443;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;, &#x442;&#x43E; &#x44D;&#x442;&#x438; &#x441;&#x441;&#x44B;&#x43B;&#x43E;&#x447;&#x43A;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x44B;&#x43C;&#x438;:<ul>
<li><a href="https://medium.com/@deathmood/how-to-write-your-own-virtual-dom-ee74acc13060" target="_blank">How to write your own Virtual DOM</a> - &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F; &#x43E; &#x442;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x439; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439; Virtual DOM;</li>
<li><a href="https://medium.com/@deathmood/write-your-virtual-dom-2-props-events-a957608f5c76" target="_blank">Write your Virtual DOM 2: Props &amp; Events</a> - &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438; &#x43E; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; Virtual DOM;</li>
<li><a href="https://swennemans.gitbooks.io/building-your-own-react-js/content/" target="_blank">Build our own React.js!</a> - gitbook &#x43E; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x439; react-like &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438;;</li>
<li><a href="https://egghead.io/courses/getting-started-with-redux" target="_blank">Getting Started with Redux</a> - &#x43A;&#x443;&#x440;&#x441; &#x43E;&#x442; &#x414;&#x44D;&#x43D;&#x430; &#x410;&#x431;&#x440;&#x430;&#x43C;&#x43E;&#x432;&#x430; &#x43F;&#x43E; Redux;</li>
</ul>
</li>
<li>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x430; js:<ul>
<li><a href="https://github.com/MostlyAdequate/mostly-adequate-guide" target="_blank">Mostly adequate guide to FP</a> - &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x430;&#x44F; &#x43A;&#x43D;&#x438;&#x433;&#x430;, &#x441; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43D;&#x430;&#x447;&#x430;&#x442;&#x44C; &#x437;&#x430;&#x43A;&#x43E;&#x43C;&#x441;&#x442;&#x432;&#x43E; &#x441; &#x43C;&#x438;&#x440;&#x43E;&#x43C; FP &#x43D;&#x430; JS;</li>
<li><a href="https://github.com/fantasyland/fantasy-land" target="_blank">Fantasy Land Specification</a> - &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x432;, &#x430;&#x43F;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x432;, &#x43C;&#x43E;&#x43D;&#x430;&#x434; &#x438; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E;. &#x41F;&#x43E;&#x43C;&#x43E;&#x436;&#x435;&#x442; &#x443;&#x433;&#x43B;&#x443;&#x431;&#x438;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x43D;&#x438;&#x44F; &#x43E;&#x431; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x44F;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x445; &#x432; FP;</li>
<li><a href="https://medium.com/@dtinth/immutable-js-persistent-data-structures-and-structural-sharing-6d163fbd73d2" target="_blank">Persistent Data Structures</a> - &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F; &#x43E; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x435; Persistent Data Scructures &#x438; &#x43F;&#x43E;&#x447;&#x435;&#x43C;&#x443; &#x438;&#x438;&#x43C;&#x443;&#x442;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x44B; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C;&#x438; &#x43F;&#x43E; &#x440;&#x430;&#x441;&#x445;&#x43E;&#x434;&#x443; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;, &#x447;&#x435;&#x43C; &#x43C;&#x443;&#x442;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435;;</li>
</ul>
</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../Git/PullRequests.html" class="navigation navigation-prev " aria-label="Previous page: Pull Requests">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="CodeEditors.html" class="navigation navigation-next " aria-label="Next page: Плагины для вашего редактора">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Полезные ссылки","level":"1.6","depth":1,"next":{"title":"Плагины для вашего редактора","level":"1.7","depth":1,"path":"Common/CodeEditors.md","ref":"./Common/CodeEditors.md","articles":[]},"previous":{"title":"Pull Requests","level":"1.5.4","depth":2,"path":"Git/PullRequests.md","ref":"./Git/PullRequests.md","articles":[]},"dir":"ltr"},"config":{"plugins":["edit-link","prism","-highlight","github","anchorjs"],"root":"./docs","styles":{"website":"build/gitbook.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/CSSSR/sputnik"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Edit This Page","base":"https://github.com/CSSSR/sputnik/blob/master/docs"},"theme-default":{"styles":{"website":"build/gitbook.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchorjs":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Sputnik","gitbook":">=3.2.1"},"file":{"path":"Common/UsefulLinks.md","mtime":"2018-04-02T09:07:44.535Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-02T11:36:38.053Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/anchor-js/4.1.0/anchor.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-anchorjs/anchor-style.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

